## Create a data frame with four rows and four columns

In [33]:
import pandas as p

In [34]:
import pandas as p
a=[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]
b=p.DataFrame(a,index=["1","2","3","4"],columns=["a","b","c","d"])
b

    a   b   c   d
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

## print all Columns form your data frame

In [35]:
b.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

## Print all rows from your data frame

In [36]:
b.loc[:]

    a   b   c   d
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

## Print Second  column in your data frame

In [37]:
b.loc[:,["b"]]

    b
1   2
2   6
3  10
4  14

## Print last 2 columns from your data Frame

In [38]:
b.loc[:,["c","d"]]

    c   d
1   3   4
2   7   8
3  11  12
4  15  16

## Print  fourth row from your data Frame

In [39]:
b.iloc[3:]

    a   b   c   d
4  13  14  15  16

## Print first 2  Rows from your data Frame

In [40]:
b.iloc[0:2]

   a  b  c  d
1  1  2  3  4
2  5  6  7  8

## Print all rows and first 2 columns from your data Frame

In [41]:
b.loc[:,["a","b"]]

    a   b
1   1   2
2   5   6
3   9  10
4  13  14

## Delete any row from your data Frame

In [42]:
b.drop("1")

    a   b   c   d
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

## Delete any column from your data Frame

In [43]:
b.pop("a")

1     1
2     5
3     9
4    13
Name: a, dtype: int64

## Add a column to a Data Frame

In [44]:
new=[5,3,2,1]
b['z']=new
print(p.DataFrame(b))

    b   c   d  z
1   2   3   4  5
2   6   7   8  3
3  10  11  12  2
4  14  15  16  1

## Add a Row to Data Frame

In [45]:
new={"b":0,"c":9,"d":5,"z":9}
a=p.DataFrame(new,index=[5])
b=p.concat([a,b])
b

    b   c   d  z
5   0   9   5  9
1   2   3   4  5
2   6   7   8  3
3  10  11  12  2
4  14  15  16  1

## Iterate all Columns  in your Data Frame and print result

In [31]:
for i in b.iteritems():
    print(i)

('b', 1     2
2     6
3    10
4    14
Name: b, dtype: int64)
('c', 1     3
2     7
3    11
4    15
Name: c, dtype: int64)
('z', 1    5
2    3
3    2
4    1
Name: z, dtype: int64)

## Iterate the 3rd column values  of your Data frame and print result.

In [14]:
x=b.pop("d")
for i in x:
    print(i)

4
8
12
16

## Iterate all Rows  in your Data Frame and print result.

In [16]:
for i in b.iterrows():
    print(i)

('1', b    2
c    3
z    5
Name: 1, dtype: int64)
('2', b    6
c    7
z    3
Name: 2, dtype: int64)
('3', b    10
c    11
z     2
Name: 3, dtype: int64)
('4', b    14
c    15
z     1
Name: 4, dtype: int64)

## Read income.csv  file and print as Data Frame

In [26]:
a="income.csv"
import pandas
x=pandas.read_csv(a)
x

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

## Get 2006 column  info from your data Frame by using drop

In [28]:
x.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528